---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.DetectedCycleInDisplacedElementParents
source: html/59bdb211-a830-6391-dd7b-e34800181978.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DisplacementElementFailures.DetectedCycleInDisplacedElementParents Property

Invalid parent relationship for a Displacement element. No cycles are allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId DetectedCycleInDisplacedElementParents { get; }
```